In [1]:
# command +shift +c  then select the mode to dark

'/Users/olivierla412/projects/DataTrained_live_classes/Imputer_Encoder'

In [2]:
import pandas as pd

In [3]:
pwd

'/Users/olivierla412/projects/DataTrained_live_classes/Imputer_Encoder'

In [7]:
df = pd.DataFrame({
    'fare':[25,48,71,85,90,120],
    'Embarked':['S','C','S','S','C','Q'],
    'Gender':['male','female','male','female','male','female'],
    'Age':[22,34,54,29,55,None]
})
df

   fare Embarked  Gender   Age
0    25        S    male  22.0
1    48        C  female  34.0
2    71        S    male  54.0
3    85        S  female  29.0
4    90        C    male  55.0
5   120        Q  female   NaN

### __Encoder__ and __Imputer__

#### __Encoder__:
###### It helps to convert text into numbers.

#### LabelEncoder() method

In [8]:
from sklearn.preprocessing import LabelEncoder

In [9]:
lab_enc = LabelEncoder()

In [10]:
df1 = lab_enc.fit_transform(df['Embarked'])

pd.Series(df1)

0    2
1    0
2    2
3    2
4    0
5    1
dtype: int64

In [11]:
df['Embarked'] = df1
df

   fare  Embarked  Gender   Age
0    25         2    male  22.0
1    48         0  female  34.0
2    71         2    male  54.0
3    85         2  female  29.0
4    90         0    male  55.0
5   120         1  female   NaN

In [33]:
df2 = lab_enc.fit_transform(df['Gender'])

In [13]:
df['Gender'] = df2
df

   fare  Embarked  Gender   Age
0    25         2       1  22.0
1    48         0       0  34.0
2    71         2       1  54.0
3    85         2       0  29.0
4    90         0       1  55.0
5   120         1       0   NaN

#### OneHotEncoder() method

In [15]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.impute import SimpleImputer
from sklearn.compose import make_column_transformer

In [35]:
## Instantiation

ohe =  OneHotEncoder()
si = SimpleImputer()

In [36]:
df_ = pd.DataFrame({
    'fare':[25,48,71,85,90,120],
    'Embarked':['S','C','S','S','C','Q'],
    'Gender':['male','female','male','female','male','female'],
    'Age':[22,34,54,29,55,None]
})
df_

   fare Embarked  Gender   Age
0    25        S    male  22.0
1    48        C  female  34.0
2    71        S    male  54.0
3    85        S  female  29.0
4    90        C    male  55.0
5   120        Q  female   NaN

In [37]:
ct = make_column_transformer(
(ohe,['Embarked','Gender']),
(si,['Age']),
remainder='passthrough') # 'passthrogh' to keep all other columns 

## SimpleImputer() can more than 1 column / (si,['Age','col2','col3',.....])

In [38]:
ct.fit_transform(df_)

array([[  0. ,   0. ,   1. ,   0. ,   1. ,  22. ,  25. ],
       [  1. ,   0. ,   0. ,   1. ,   0. ,  34. ,  48. ],
       [  0. ,   0. ,   1. ,   0. ,   1. ,  54. ,  71. ],
       [  0. ,   0. ,   1. ,   1. ,   0. ,  29. ,  85. ],
       [  1. ,   0. ,   0. ,   0. ,   1. ,  55. ,  90. ],
       [  0. ,   1. ,   0. ,   1. ,   0. ,  38.8, 120. ]])

### __Imputer:__
##### It means Imputation ==> fill NAN